// SPDX-License-Identifier: GPL-3.0
pragma solidity ^0.8.17;

contract BlindAuction_5 {    
 
    /**===============状态变量声明=================*/   
    
   /***************************** begin ***************************************************/
    //声明一个结构体类型，类型成员包含竞拍出价哈希和预存以太币。
    //结构体类型命名为Bid，出价哈希命名为blindedBid，预存以太币命名为deposit
   //在此处添加添加


    //定义映射类型公共变量，命名为bids。用于存放账户和出价信息的映射关系。注意竞拍者可以参与多次竞拍，出价信息可能存在多次
    //因此出价信息是由结构体类型数据构成的数组
    //在此处添加添加
  

    /***************************** end ***************************************************/   
     
    


    /***************************** begin ***************************************************/
    //编写一个出价方法,命名为bid,接收参数为本次出价者的出价哈希，命名为_blindedBid,将出价哈希和预存以太币映射到当前账户,
    //该方法允许外部访问和接收以太币
 




    /***************************** end ***************************************************/   

   

   
}